Repository: 84000/data-translation-memory
Catalog: toh257-v4.tmx
Source language: bo
Languages: en

source: ཡུལ་གཞན་ནམ། གླིང་བཞི་པ་གཞན་ནམ། སངས་རྒྱས་ཀྱི་ཞིང་གཞན་གྱི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། རང་རྒྱལ་བ་དང་། ཉན་ཐོས་ཆེན་པོ་རྣམས་དང་། དྲང་སྲོང་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་རྫུ་འཕྲུལ་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་རྣམས་ནི་མ་གཏོགས་ཏེ།
en: There are only bodhisattva great beings, solitary buddhas, great hearers, and sages who have mastered the five higher perceptions and the magical powers who have arrived from other regions, other four-continent worlds, and other buddha realms.

source: དེ་དག་ནི་རྫུ་འཕྲུལ་གྱི་སྟོབས་ཀྱིས་མཆོད་པ་བགྱི་བའི་སླད་དུ་དྲང་སྲོང་ཐུབ་པའི་གནས་གོ་མ་སཱ་ལ་གན་དྷ་དེར་ལྷགས་ཏེ། དེ་ནས་སླར་ཡང་མཆི་བར་བགྱིད་དོ།
en: They have used their miraculous powers to arrive at Gomasālagandha, that sacred site of wise sages, to worship it, but afterward they will leave again.

source: །བཙུན་པ་བཅོམ་ལྡན་འདས་ད་ལྟར་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་སུ་ཡང་དེ་ཀུན་ཏུ་བསྲུང་བའི་སླད་དུ་སྤྲོ་བར་མ་གྱུར་པ་ལ་གཟིགས།
en: Respected Blessed One, I have just witnessed that none of the yakṣa leaders are eager to protect that place.

source: གནས་དེ་ངན་པར་རྩི་བ་ཞིག་མ་ལགས་སམ་ཞེས་བདག་ངོ་མཚར་དུ་གྱུར་ལགས་སོ།
en: So now I am left wondering whether this should not be regarded as a bad place.”

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ལག་འགྲོའི་བདག་པོ་དེ་སྐད་མ་སྨྲ་ཤིག །
en: The Blessed One replied, “Nāga lord, do not say such things!

source: ཁ་ཤའི་ཡུལ་ན་བདེན་པ་མཐོང་བ་དང་། དབང་ཆེ་བར་གྲགས་པ་དབང་ཆེ་བར་གྲགས་པ་ཉི་ཁྲི་གནས་པ་གང་དག་ཡིན་པ་དེ་དག་གིས་དྲང་སྲོང་ཐུབ་པའི་གནས་མཆོད་རྟེན་ཆེན་པོ་གོ་མ་སཱ་ལ་གན་དྷ་ལ་ཉིན་མཚན་དུ་མཆོད་པ་བྱེད་པར་འགྱུར་རོ།
en: In the land of Khaṣa there are twenty thousand powerful beings who see the truth and are renowned for their great powers. They will perform worship day and night at that great stūpa Gomasālagandha, the sacred site of wise sages.

source: །གཞན་ཡང་ལག་འགྲོའི་བདག་པོ་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་འོད་སྲུང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་སྐྱེ་དགུས་ལོ་སུམ་སྟོང་ལོན་པ་ན་སའི་ནུ་མའི་གནས་སུ་ཡུལ་འཁོར་ཆེན་པོ་རྡོ་རྩུབ་ཅེས་བྱ་བ་བདེ་བ་དང་དགའ་བར་བྱེད་པ།
en: Furthermore, nāga lord, three thousand years after the thus-gone Kāśyapa passed into perfect nirvāṇa, Breast of the Earth was home to a country called Rough Stone.

source: མི་དང་སྐྱེ་བོ་མང་པོས་གང་བ་ཞིག་བྱུང་བར་གྱུར་ཏོ།
en: It was filled with many humans and other beings, and everyone lived happily and joyfully.

source: །དེ་ན་དྲང་སྲོང་སྦྱིན་གནས་བསམ་གཏན་ལ་མངོན་པར་དགའ་བ་ཐེག་པ་བླ་ན་མེད་པ་འདོད་པ་ལྔ་འབུམ་སྙེད་ཀྱི་མང་པོ་གནས་པར་གྱུར་ཏོ།
en: Five hundred thousand sages who were worthy of gifts, reveled in the concentrations, and wished for the unsurpassed vehicle resided in that place.

source: །དེའི་ཚེ་མི་རྣམས་ཟས་ལ་འཁྲེན་ཏེ།
en: At that time, humans craved food.

source: དེ་དག་ཁ་ཟས་ཀྱི་ཕྱིར་དྲང་སྲོང་དེ་དག་ལ་འཁྲིག་པ་དང་ལྡན་པས་མི་སྙན་པར་རྗོད་པར་བྱེད་དོ། །ཐལ་བ་དང་རྡུལ་གྱིས་འཐོར་བར་བྱེད་དོ།
en: For the sake of food, they accused the sages of engaging in sexual intercourse and threw dust and ashes at them.

source: །དེའི་ཚེ་དྲང་སྲོང་དེ་དག་ཡུལ་འཁོར་རྡོ་རྩུབ་དེ་ནས་དོང་ངོ་།
en: Hence, the sages eventually left the country Rough Stone.

source: །དེ་ནས་སེམས་ཅན་དེ་དག་དྲང་སྲོང་དོང་བ་དེ་དག་ལ་མཆོག་ཏུ་དགའ་ཞིང་ཡི་རངས་པར་གྱུར་ཏོ།
en: When they saw that the sages had left, those beings rejoiced and were overjoyed.

source: །དེའི་ཕྱིར་དང་པོར་ཁྱོད་ཁྲོས་ཏེ། དེ་དག་གི་ཆུ་ཀུན་ཏུ་ཆད་ནས་ཡུལ་འཁོར་དེར་ཀླུང་དང་། འབབ་ཆུའི་ངོགས་དང་། མཚོ་དང་། མཚེའུ་དང་། ལུ་མའི་ཆུ་དང་། ཁྲོན་པ་དག་སྐམས་པ་ཁྱོད་ཀྱིས་དྲན་ནམ།
en: Do you remember how furious you became, and how you deprived them of their water by drying out the rivers, streams, lakes, ponds, springs, and wells in their country?

source: ཡུལ་དེར་མེ་ལྷ་ཁྲོས་ཏེ་སེམས་ཅན་དེ་དག་གི་མེ་ཀུན་ཏུ་ཆད་ནས་སེམས་ཅན་དེ་དག་བཀྲེས་པ་དང་སྐོམ་པས་གཟིར་ཏེ།
en: In that land, the fire god also became angry and extinguished the fires of those beings, leaving them tormented by hunger and thirst.

source: འཆི་བའི་དུས་བྱས་ནས་རིང་པོར་མ་ལོན་པར་དེ་འབྲོག་དགོན་པར་གྱུར་ཏོ། །དེ་ལྟར་ཡུན་རིང་པོར་ཡང་དག་པར་གནས་པར་གྱུར་པ་དག་ཀྱང་དེ་བཞིན་ནོ།
en: After they died, those beings were soon born in isolated places where they remained for a long time.

source: །ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ནས་ལོ་བརྒྱ་ལོན་པ་དང་། དེར་ཇི་ནས་ཀྱང་སའི་ནུ་མའི་གནས་དེར་གྲོང་དང་། གྲོང་ཁྱེར་དང་། གྲོང་རྡལ་དང་། ཡུལ་འཁོར་དང་། རི་བྲགས་རྣམས་གནས་པར་འགྱུར་བ་དང་། སེམས་ཅན་ཐེག་པ་ཆེན་པོ་ལ་ཡང་དག་པར་ཞུགས་པ་རྣམས་ཀྱི་ལོངས་སྤྱོད་དང་། ཉེ་བར་སྤྱོད་པའི་གནས་དང་། བདེ་བ་དང་། དགའ་བར་བྱེད་པ་དང་། མི་དང་། སྐྱེ་བོ་མང་པོས་གང་བར་འགྱུར་བར་ང་དེར་གཤེགས་པར་མཛད་དེ། དྲང་སྲོང་ཐུབ་པའི་གནས་གོ་མ་སཱ་ལ་གན་དྷ་དེ་ཞག་བདུན་ལོངས་སྤྱོད་པར་མཛད་དོ།
en: I will now go to Gomasālagandha and reside for seven days at that sacred site of wise sages so that a hundred years after I pass into parinirvāṇa there will be villages, cities, towns, countries, and mountain hamlets at Breast of the Earth. There will be resources and possessions for sentient beings who follow the Great Vehicle, everyone will live happily and joyfully, and the place will be filled with many humans and other beings.”

source: །དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱིས་གནོད་སྦྱིན་གྱི་སྡེ་དཔོན་ཆེན་པོ་མིང་ཅན་ལ་བཀའ་སྩལ་པ། མིང་ཅན་ཁྱོད་ཀྱིས་དྲན་ནམ།
en: The Blessed One then asked the yakṣa leader Famous, “Famous, do you remember?”

source: གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་སྔོན་རི་གླང་རུ་དེ་ལ་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་འོད་སྲུང་གིས་སྐྱིལ་མོ་ཀྲུང་གཅིག་གིས་རྣམ་པར་གྲོལ་བའི་བདེ་བས་དགུང་བདུན་འདས་པར་མཛད་དེ།
en: “Respected Blessed One,” replied Famous, “I remember how in the past the thus-gone Kāśyapa spent seven days in a single sitting at Mount Gośṛṇga, resting in the happiness of liberation.

source: དགུང་བདུན་པོ་དེ་འདས་ནས་ཏིང་ངེ་འཛིན་དེ་ལས་བཞེངས་ཏེ། དྲང་སྲོང་ཐུབ་པའི་གནས་གོ་མ་སཱ་ལ་གན་དྷ་དེ་ལ་བཞུགས་པ་དང་། དེའི་ཚེ་དེའི་སྲུང་བ་འཛིན་པ་དང་། པྱི་པྱི་ལིང་གི་ཤིང་བསྲུང་བ་གང་དག་ལགས་པ་དང་།
en: After those seven days had passed, when he arose from that absorption, he remained at Gomasālagandha, that sacred site of wise sages. I remember those who protected him during that time, as well as those who guarded the pippalī trees.

source: དེའི་ཉན་ཐོས་བསྙེན་བཀུར་ལ་མངོན་པར་བརྩོན་པ། ཏིང་ངེ་འཛིན་ལ་མངོན་པར་བརྩོན་པ། ཆོས་ཀྱིས་གནས་པ་རྣམས་ཀྱིས་སྲུང་བ་འཛིན་པ་དང་། པྱི་པྱི་ལིང་གི་ཤིང་སྲུང་བ་གང་དག་ལགས་པ་བདག་གིས་དྲན་ལགས་སོ།
en: I also remember those who exerted themselves in serving his hearers, those who exerted themselves in the absorptions, and those who protected the people who abided by the Dharma, as well as those who guarded the pippalī trees.”

source: །དེ་ནས་ཀླུའི་རྒྱལ་པོ་ཁྱིམ་བདག་གིས་བྱིན་གྱིས་གསོལ་པ། བཙུན་པ་བཅོམ་ལྡན་འདས་དེ་བཞིན་དུ་ཡུན་ཇི་སྲིད་དུ་ཉན་ཐོས་དེ་དག་ཡོངས་སུ་འཛིན་པ་མ་མཆིས་པར་གནས་པ་དེ་སྲིད་དུ་བདག་གིས་བསྲུང་བར་བགྱི་ལགས་སོ།
en: The nāga king Given by a Householder exclaimed, “Respected Blessed One, as long as there are hearers without assistance, I shall protect them!

source: །གཞན་ཡང་བྱམས་པའི་དུས་ཀྱི་བར་དུ་མཆོད་རྟེན་ཆེན་པོ་གོ་མ་སཱ་ལ་གན་དྷ་དུས་རྟག་ཏུ་ཆབ་དང་། ཞུགས་དང་། གནོད་སྦྱིན་དང་། གྲུལ་བུམ་གྱིས་ཀུན་ཏུ་འཁྲུག་པ་རྣམས་ལས་བདག་གིས་བསྲུང་བར་བགྱི་ལགས་སོ།
en: Until the time of Maitreya, I shall always protect that great stūpa Gomasālagandha from the troubles caused by water, fire, yakṣas, and kumbhāṇḍas!”

source: །ངའི་ཆོས་ཀྱི་ཚུལ་དེ་ལྟར་ཤིན་ཏུ་བྱིན་གྱིས་བརླབས་པས་གྲོགས་པོ་དང་སྦྱིན་བདག་དེ་ལྟ་བུ་དག་གིས་ཡུན་རིང་པོར་འབར་བར་བྱེད་པར་འགྱུར་རོ།
en: “Through such blessings, those friends and benefactors will make my Dharma way blaze for a long time!”

source: །ཡང་དེའི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་པོ་གང་དག་ཕྱོགས་བཅུའི་སངས་རྒྱས་ཀྱི་ཞིང་གཞན་དག་ནས་ལུང་བསྟན་པ་ཆེན་པོ་ཉི་མའི་སྙིང་པོ་མཉན་པར་བྱ་བའི་ཕྱིར་ལྷགས་ཤིང་འདུས་པ་དེ་དག་གིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་ཀྱང་གླིང་བཞི་པ་འདིར་གནས་པར་བགྱི་ལགས་སོ།
en: At that moment, the six hundred million bodhisattva great beings who had arrived and gathered from other buddha realms of the ten directions to listen to the great teaching of The Quintessence of the Sun said, “Respected Blessed One, we shall also remain within this four-continent world!

source: །དྲང་སྲོང་ཐུབ་པའི་གནས་མེ་ཏོག་ནས་བ་དན་གྱི་བར་དང་། གསེར་ནས་ས་ལེ་སྦྲམ་གྱི་བར་གྱིས་ཡོངས་སུ་གཏམས་པར་བགྱི་ལགས་སོ།
en: We shall fill those sacred sites of wise sages with offerings ranging from flowers to flags and with gold of various degrees of refinement!

source: །ལས་འབྱང་བའི་གཟུངས་སྔགས་ཉི་མའི་སྙིང་པོ་འདི་བཅང་བར་བགྱི་ལགས་སོ། །གཞན་དག་ལ་བསྟན་པར་བགྱི་ལགས་སོ།
en: We shall uphold this Quintessence of the Sun—the dhāraṇī mantra that purifies karmic action—and reveal it to others!

source: །ཡང་དག་པར་རབ་ཏུ་བསྟན་པར་བགྱི་ལགས་སོ།
en: We shall teach it extensively!

source: །བཅོམ་ལྡན་འདས་ཀྱིས་ཇི་སྐད་བསྟན་པའི་གཟུངས་སྔགས་དེ་ཡང་ཡིད་ཀྱིས་རྗེས་སུ་བརྟགས་ཏེ་གནས་པར་བགྱི་ལགས་སོ།
en: We shall reflect on and abide by the dhāraṇī mantra that the Blessed One has taught!

source: །བྱང་ཆུབ་ཀྱི་ལམ་དང་། ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་ཡོངས་སུ་རྫོགས་པར་བགྱི་བའི་སླད་དུ་བདག་དང་གཞན་གྱི་ལས་ཀྱི་སྒྲིབ་པ་བྱང་བར་བགྱི་ལགས་སོ།
en: To perfect the path of awakening and the six perfections, we shall purify ours and others’ karmic obscurations!

source: །ད་ལྟར་བདུད་བྱེ་བ་དེ་དག་ལྷགས་ཤིང་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་གྲངས་མ་མཆིས་པ། དཔག་ཏུ་མ་མཆིས་པ་དེ་དག་ཀྱང་ལྷགས་ཏེ།
en: Ten million māras have assembled here today, as have an innumerable and limitless number of gods, nāgas, yakṣas, asuras, garuḍas, kinnaras, and mahoragas.

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཀྱང་དྲང་སྲོང་ཐུབ་པའི་གནས་མཆོད་རྟེན་ཆེན་པོའི་གནས་དེ་དག་ཐམས་ཅད་ཀླུ་རྣམས་དང་། གནོད་སྦྱིན་རྣམས་ཀྱི་སུག་པར་ཆང་ཁྱིར་སྩལ་ལགས་སོ།
en: The Blessed One has placed the protection of all those great stūpas, those sacred sites of wise sages, in the hands of the nāgas and the yakṣas.

source: །འོན་ཀྱང་འདི་ལ་བདུད་དང་། ལྷ་དང་། མི་འམ་ཅི་དང་། ལྷ་མ་ཡིན་དེ་དག་གི་སེམས་གཞན་དུ་གྱུར་ཏེ། བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་ཐུབ་པའི་གནས་དེ་རྣམས་དག་པ་དག་གི་སུག་པར་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་ལགས་ཞེས། བཅོམ་ལྡན་འདས་ཀྱིས་ད་ལྟར་དང་། མ་འོངས་པའི་དུས་ན་མི་རྣམས་ཀྱི་བར་གྱིས་མཆོད་རྟེན་ཆེན་པོའི་གནས་དེ་དག་ལ་མི་ཕན་པ་དང་། རབ་ཏུ་འཇིག་པ་དང་། རྣམ་པར་འཇིག་པར་ཕ་རོལ་གནོད་པར་འགྱུར་བ་དེ་ལྟ་བུ་མ་དགོངས་ན་མི་རུང་ལགས་སོ།
en: However, since the minds of the māras, the gods, the kinnaras, and the asuras have changed, the Blessed One declared, ‘I now entrust the protection of those sacred sites of wise sages to pure beings.’ But perhaps the Blessed One is not aware that now or in the future other beings such as humans might harm, demolish, and destroy those great stūpas. That would not be good!”

source: །མ་འཇིགས་ཤིག །མ་སྐྲག་ཤིག །འདིར་སྔོན་གྱི་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་དག་བྱུང་བར་གྱུར་པ་དེ་དག་གིས་དྲང་སྲོང་ཐུབ་པའི་གནས་མཆོད་རྟེན་ཆེན་པོའི་གནས་དེ་དག་ཐམས་ཅད་བྱིན་གྱིས་བརླབས་ནས་ཀླུ་རྣམས་དང་། གནོད་སྦྱིན་རྣམས་ལ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ།
en: But do not be afraid! Do not be scared! The perfect buddhas of the past have blessed all those great stūpas, those sacred sites of wise sages, and they have entrusted their protection to the nāgas and yakṣas.

source: །དེ་བཞིན་དུ་ད་ལྟར་ངས་ཀྱང་དྲང་སྲོང་ཐུབ་པའི་གནས་མཆོད་རྟེན་ཆེན་པོའི་གནས་ཐམས་ཅད་ཀླུ་རྣམས་དང་། གནོད་སྦྱིན་རྣམས་ཀྱི་ལག་ཏུ་ཆང་ཁྱིར་ཡོངས་སུ་གཏད་དོ།
en: Similarly, I now entrust the protection of all those great stūpas, those sacred sites of wise sages, to the nāgas and yakṣas.

source: མི་ཁོམ་པ་བརྒྱད་ཐོབ་པ་དེ་དག་གི་ལས་ཀྱི་སྒྲིབ་པ་ཡང་དག་པར་བྱང་བར་བྱ་བ་དང་། བྱང་གྲོལ་གྱི་བདེ་བའི་རྒྱུ་ཡང་དག་པར་བསྐྱེད་པར་བྱ་བ་དང་། སེམས་ཅན་རྣམས་ཀྱི་ཉེ་བར་འཚོ་བའི་ཡོ་བྱད་ས་བོན་གྱི་ཚོགས་དང་། འབྱུང་བའི་ཚོགས་དང་། སྨན་དང་། ནགས་ཚལ་རྣམས་ཡང་དག་པར་རབ་ཏུ་སྐྱེ་བར་བྱ་བ་དང་། བཟའ་བ་རྣམ་པ་སྣ་ཚོགས་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། དུས་མ་ཡིན་པའི་རླུང་དང་ཆར་པ་རབ་ཏུ་ཞི་བར་བྱ་བའི་ཕྱིར་དྲང་སྲོང་ཐུབ་པའི་གནས་མཆོད་རྟེན་ཆེན་པོའི་གནས་དེ་དག་ཀླུ་རྣམས་དང་། གནོད་སྦྱིན་རྣམས་ཀྱི་ལག་ཏུ་ཡོངས་སུ་གཏད་པའི་ཕྱིར་རོ།
en: I entrust the protection of those great stūpas, those sacred sites of wise sages, to the nāgas and yakṣas in order to purify the karmic obscurations of those who have obtained the eight unfree states, to create the causes of the happiness of emancipation, to generate the conditions and the manifestation of everything needed to sustain sentient beings, to cause the growth of medicinal plants and forests, to make a variety of foods ripen, and to pacify untimely winds and rain.

source: །ཡང་གཞན་ཡང་མཆོད་རྟེན་ཆེན་པོའི་གནས་བྱུང་ངོ་ཅོག་དང་། འབྱུང་བར་འགྱུར་བ་གང་དུ་དེ་བཞིན་གཤེགས་པ་བལྟམས་པ་དང་། དཀའ་ཐུབ་ཀྱི་ཚལ་གང་དུ་བསམ་གཏན་ལ་མངོན་པར་བརྩོན་པ་དང་། གང་དུ་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དང་། གང་དུ་ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བ་ནས་གང་དུ་དེ་བཞིན་གཤེགས་པའི་ཆོས་ཀྱི་སྐུའམ།
en: Furthermore, whether in the past or in the future, all the great stūpas where the thus-gone ones are born are sacred places for the world with its gods. The same is true for those places where they exert themselves in concentration in the forest of ascetics, awaken to perfect buddhahood, and turn the wheel of Dharma.

source: བཙས་པའི་སྐུ་རབ་ཏུ་བཞག་པའི་བར་དང་། གང་དང་གང་དུ་དེ་བཞིན་གཤེགས་པའི་ཉན་ཐོས་ཆོས་ཀྱིས་གནས་པ་རྣམས་གནས་པར་གྱུར་པ་དང་། གནས་པར་འགྱུར་བ་ནས་ངའི་ཆོས་ཀྱི་ཚུལ་གནས་པར་འགྱུར་བའི་བར་གྱིས་གནས་དེ་དག་ཐམས་ཅད་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་གྱི་མཆོད་རྟེན་དག་ཡིན་ནོ།
en: The same is true for those places where thus-gone ones’ Dharma bodies or born emanations are located, where the thus-gone ones’ hearers who abide by the Dharma reside, and where my Dharma way remains.

source: །ཡང་མཆོད་རྟེན་ཆེན་པོའི་གནས་དེ་དག་ཀྱང་བདུད་རྣམས་དང་། ལྷ་རྣམས་དང་། ཀླུ་རྣམས་དང་། གནོད་སྦྱིན་རྣམས་དང་། ལྷ་མ་ཡིན་རྣམས་ཀྱི་ལག་ཏུ་ཡོངས་སུ་བསྐྱང་བར་བྱ་བའི་ཕྱིར་ཡོངས་སུ་གཏད་དོ།
en: I also entrust the protection of those great stūpas to the māras, gods, nāgas, yakṣas, and asuras.

source: །གཞན་ཡང་འབྱུང་པོ་ཐམས་ཅད་རབ་ཏུ་དད་པར་བྱེད་པ་དང་། ཕྱིར་མི་ལྡོག་པར་བྱེད་པ་གང་འདི་ལུང་བསྟན་པ་ཆེན་པོ་ཏིང་ངེ་འཛིན་མངོན་པར་སྒྲུབ་པ། སོ་སོར་སྡང་བ་ཐམས་ཅད་ཕྱིར་ཟློག་པར་བྱེད་པ་ཞེས་བྱ་བ་ངས་ཁྱེད་ཅག་ལ་སྦྱིན་པར་བྱ་སྟེ།
en: “Furthermore, I will now confer upon you the great teaching that generates faith in and repels all bhūtas. It is known as the great teaching that accomplishes absorption and repels hostile beings.

source: སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་གསུངས་ཤིང་བྱིན་གྱིས་བརླབས་ལ་མངོན་པར་རྗེས་སུ་ཡི་རང་བར་མཛད་པ།
en: It has been taught and blessed by all the thus-gone ones of the past, who rejoiced thereby.

source: སྡང་བ་རྣམས་མངོན་པར་དད་པར་བྱེད་པ། ཕྱིར་ཟློག་པར་བྱེད་པ། དགེ་བ་ལ་ཡང་དག་པར་སྦྱོར་དུ་འཇུག་པ་ཡིན་ནོ།
en: It has generated faith in and repelled hostile beings, and it has caused them to engage in virtue.

source: །དེ་བཞིན་དུ་མ་བྱོན་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ཞེས་བྱ་བ་ནས་མངོན་པར་དད་པར་བྱེད་ཅིང་ཕྱིར་ཟློག་པར་བྱེད་ལ། དགེ་བ་ལ་ཡང་དག་པར་སྦྱོར་དུ་འཇུག་པའི་བར་དུ་ཡིན་ནོ།
en: Similarly, all the future thus-gone ones will teach it and bless it, and they will rejoice thereby. It will generate faith in and repel hostile beings, and it will cause them to engage in virtue.

source: །ལུང་བསྟན་པ་ཆེན་པོ་རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞིའི་རྒྱུ་འཐུན་པ།
en: This great teaching is the outcome of the four bases of miraculous displays.

source: མངོན་པར་སྒྲུབ་པའི་བདག་པོ་ཆེན་པོ་སྡང་བ་ཐམས་ཅད་ཕྱིར་ལྡོག་པར་བྱེད་པ་འདི་ནི་བརྟུལ་ཞུགས་ཆེན་པོ་ཡང་དག་པར་སྒྲོལ་བར་བྱེད་པའོ།
en: It is the great lord of accomplishment that repels all hostile beings. It frees beings from great disciplined observances.

source: །ཡེ་ཤེས་ཆེན་པོ་ལ་འཇུག་པར་བྱེད་པའོ།
en: It causes one to engage with great wisdom.

source: །ཐོས་པ་མང་པོ་ཀུན་ཏུ་འཛིན་པའོ།
en: It causes one to remember a great amount of learned knowledge.

source: །ཐབས་ཆེན་པོ་ཡང་དག་པར་སྒྲོལ་བར་བྱེད་པའོ།
en: It frees beings from great methods.

source: །དགྲ་ཆེན་པོ་ངེས་པར་འདུལ་བར་བྱེད་པའོ།
en: It definitely subjugates the great enemies.

source: །སྡང་བ་ཆེན་པོ་རབ་ཏུ་དད་པར་བྱེད་པའོ།
en: It generates faith in those who show great hostility.

source: །ནད་ཆེན་པོ་ལས་རབ་ཏུ་ཐར་བར་བྱེད་པའོ། །ནད་ཆེན་པོ་ལས་རབ་ཏུ་སྒྲོལ་བར་བྱེད་པའོ།
en: It heals severe diseases.

source: །འཇིགས་པ་ཆེན་པོ་ཕྱིར་ཟློག་པར་བྱེད་པའོ།
en: It repels great terrors.

source: །དགོན་པ་ཆེན་པོ་ལས་ངེས་པར་རྒལ་བར་བྱེད་པའོ།
en: It enables one to cross great wildernesses.

source: །བདེན་པ་ཆེན་པོ་མཐོང་བར་བྱེད་པའོ།
en: It causes one to see the great truths.

source: །བཟོད་པ་ཆེན་པོ་ལ་རེག་པར་བྱེད་པའོ། །ཡེ་ཤེས་ཆེན་པོའི་རྒྱ་མཚོ་ལ་འཇུག་པར་བྱེད་པ་ཡིན་ནོ་ཞེས་བྱ་བ་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱེད་པའོ་ཞེས་བྱ་བའི་བར་དུའོ། །
en: It causes one to reach great acceptance. It makes one enter the ocean of great wisdom. It causes one to fully awaken to unsurpassed and perfect buddhahood.

source: ཏདྱ་ཐཱ། ཨཱ་མ་ཨ་བཱ་ས། ཨཱ་མ་བ་རི་བ་ར། སྃ་ཤྲཱི་ཡ། གམྦྷ་པ་རི་པཱ་སཱ། མི་ཏྲ་མི་ཏྲ། ཤྭཱ་ཡ་མི་ཏྲ། པ་རི་བཱ་སཱ། མི་ཏྲ་ས་མ་ཛྙཱ་ཡ། ནི་ཀ་ཐ་ས་མ་ཛྙཱ་ཡ། ཏྲི་ཤྱང་གྷ་བ། དྲ་བ། རཱ་ཛ། བི་ན་ཤཱ་ཡ། ས་མ་ཤཱ་ཡ། ནིར་ཨན་བྷ་དྲ་མ། བཱ་བཱ་གྲམ། རྀད་དྷི་བི་གྲ་མཎ། ས་མ་ཛྙཱ་ན། ཨ་བ་བརྒ། ན་རཱ་ཡ་ན་བརྒ། ས་མཱ་གྲམ། སརྦ་ཏ་ཐཱ་ག་ཏ་ཨ་དྷིཥྛ་ན་མཱ་རྒ་སྭཱ་ཧཱ།
en: tadyathā: āma avāsa āmavarivara saṁśrīya garbhaparipāsā mitramitra śvāyamitra parivāsā mitrasamajñāya nikathasamajñāya triśyaṅghava drava rāja vinaśāya samaśāya niranbhadrama vāvāgram ṛddhivigramaṇ samajñāna avavarga narāyanavarga samāgram sarvatathāgata adhiṣṭhānamārga svāhā.

source: བཞིན་བཟངས་དག་འདི་ནི་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་གསུངས་ཤིང་བྱིན་གྱིས་བརླབས་པ་སྟེ།
en: “Good beings, this has been taught and blessed by all the buddhas.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པའི་རྒྱུ་འཐུན་པའི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་མངོན་པར་སྒྲུབ་པ། སྡང་བ་ཐམས་ཅད་ཕྱིར་ཟློག་པར་བྱེད་པ་ནས་དགེ་བ་ལ་ཡང་དག་པར་སྦྱོར་དུ་འཇུག་པར་བྱེད་པའི་བར་དང་། བརྟུལ་ཞུགས་ཆེན་པོ་ཡང་དག་པར་སྒྲོལ་བར་བྱེད་པ་ནས་བྱང་ཆུབ་ཐམས་ཅད་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱེད་པའི་བར་ཡིན་ནོ། །གང་དང་གང་དུ་ད་ལྟར་དང་། མ་འོངས་པའི་དུས་སུ་དེའི་ཚེ་མཆོད་རྟེན་ཆེན་པོའི་གནས་དེ་དག་ལ་བདུད་དམ། ལྷའམ། ཀླུའམ། གནོད་སྦྱིན་ནམ། སྲིན་པོའམ། ལྷ་མ་ཡིན་ནམ། ནམ་མཁའ་ལྡིང་ངམ། མི་འམ་ཅིའམ། གྲུལ་བུམ་ནས་མི་དང་མི་མ་ཡིན་པའི་བར་དུ་སུས་ཆུའམ། མེའམ། ཕ་རོལ་གནོན་པ་གཞན་གང་ཡང་རུང་བ་ཞིག་གིས་མི་ཕན་པ་དང་། རབ་ཏུ་འཇིག་པ་དང་། རྣམ་པར་འཇིག་པར་རྟུལ་བར་བྱེད་ན་དེར་ཁྱེད་ཀྱིས་འདི་ལྟར་དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཡིད་ལ་བྱ་ཞིང་སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་བྱམས་པའི་ཡིད་ཀྱིས་ལུང་བསྟན་པ་ཆེན་པོ་ཏིང་ངེ་འཛིན་ཐམས་ཅད་མངོན་པར་སྒྲུབ་པ། སྡང་བ་ཐམས་ཅད་ཕྱིར་ཟློག་པར་བྱེད་པ་འདི་དྲན་པར་བྱས་ན་དེའི་ཚེ་དེ་དག་གི་སེམས་ཀྱི་རྒྱུད་རབ་ཏུ་དད་པར་བྱེད་པར་འགྱུར་རོ། །ཕྱིས་ཀྱང་རྣམ་པར་གཞིག་པར་བྱ་བའི་ཕྱིར་རྟུལ་བར་མི་བྱེད་དོ།
en: It accomplishes the absorptions that are the outcome of the four bases of miraculous displays. It repels all hostile beings and causes them to engage in virtue. It frees beings from great disciplined observances. [. . .] It causes one to fully awaken to unsurpassed and perfect buddhahood. Now and in the future, if māras, gods, nāgas, yakṣas, rākṣasas, asuras, garuḍas, kinnaras, kumbhāṇḍas, humans, or nonhumans attempt to harm, destroy, or demolish those great stūpas with water, fire, or any other hostile means, you should focus your attention on the thus-gone ones of the three times, and with a loving attitude toward all sentient beings you must recollect this great teaching, which accomplishes all absorptions and repels all hostile beings. If you do so, it will generate faith in their minds, and henceforth they will no longer attempt to destroy those places.

source: །རིགས་ཀྱི་བུ་གང་གིས་ལུང་བསྟན་པ་ཆེན་པོ་ཏིང་ངེ་འཛིན་ཐམས་ཅད་མངོན་པར་སྒྲུབ་པ། སྡང་བ་ཐམས་ཅད་ཕྱིར་ཟློག་པར་བྱེད་པ་འདི་ཐོས་ནས་སྡིག་པའི་སེམས་ཕྱིར་ཟློག་པར་མི་བྱེད་པ་དང་། ཉེས་པར་བྱས་པའི་ལས་སྤོང་བར་མི་བྱེད་པ་ནི་ལྷ་དང་བཅས་པའི་འཇིག་རྟེན་ནས་སྐྱེ་དགུའི་བར་ལ་ངས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་སྟེ། སྔོན་གྱི་ཤ་ཁོན་དང་འདྲེས་པ་ནི་མ་གཏོགས་སོ།
en: Noble sons, in the world with its gods and all its beings, I have never seen anyone who did not turn away from negativity and abandon unwholesome actions after having heard this great teaching, which accomplishes all absorptions and repels all hostile beings—apart from those who hold on to past enmity.”

source: །ཀྱེ་བཅོམ་ལྡན་འདས་ཀྱིས་ལུང་བསྟན་པ་འདི་བཤད་པ་ན་འཁོར་དེའི་ནང་ནས་ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། སྲིན་པོ་དང་། ཡི་དགས་དང་། གྲུལ་བུམ་དང་། ཤ་ཟ་དང་། མི་དང་། མི་མ་ཡིན་པ་གང་དག་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་དད་པ་དེ་དག་ཐམས་ཅད་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བ་དང་། མཆོག་ཏུ་དགའ་བ་དང་། རབ་ཏུ་དད་པ་སྐྱེས་སོ།
en: Oh! As this teaching was being expounded by the Blessed One, the gods, nāgas, yakṣas, rākṣasas, pretas, kumbhāṇḍas, piśācas, humans, and nonhumans who had sincere faith in the Blessed One were overjoyed and became ecstatic, and they developed utmost faith in him.

source: །ཡང་དེའི་ཚེ་བཅོམ་ལྡན་འདས་ཀྱི་རྫུ་འཕྲུལ་གྱི་མཐུས་བདུད་སྡིག་ཅན་བདག་གིས་རང་གི་གནས་སུ་ཏིང་ངེ་འཛིན་མངོན་པར་སྒྲུབ་པ་འདི་ཐོས་སོ།
en: At that same time, through the miraculous powers of the Blessed One, the evil Māra himself heard in his abode this teaching that accomplishes absorption.

source: །ཐོས་ནས་ཀྱང་བཅོམ་ལྡན་འདས་ལ་ཤིན་ཏུ་དགའ་བ་དང་། དད་པ་དང་། གུས་པ་སྐྱེས་ནས་མཆི་མ་དག་ཕྱུང་སྟེ། འཁོར་རྣམས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: When he heard it, intense appreciation, faith, and respect for the Blessed One arose in him. With tears in his eyes, he said to his retinues,

source: །ངའི་ཚིག་ཉོན་ཅིག །འདི་ནི་དྲང་སྲོང་ཐུབ་པ་རྒྱལ་བའི་མཆོག་བཟོད་པ་དང་། ཡོན་ཏན་དང་། ངེས་པའི་ཚིག་རབ་མཆོག་ཅན་དེ་སྲིན་བུས་གང་བའི་རིའི་གནས་དམ་པ་ལ་འབར་བ་ལ་ལག་འགྲོ་ཆེན་པོ་དང་། ལྷ་རྣམས་ཀྱིས་བཟོད་པའི་དུས་བསྟན་ཏེ།
en: “Listen to my words! The great nāgas and gods on that sacred and splendorous mountain site, which is filled with worms, have asked the wise sage, the sublime Victor who is endowed with supreme acceptance, qualities, and expression, for forgiveness.

source: ང་ཡང་དེར་འགྲོ་ཞིང་མཉམ་པ་མེད་པའི་དགེ་སྦྱོང་ལ་བཟོད་པར་གསོལ་ལོ།
en: I will also go there and ask that peerless spiritual practitioner for forgiveness.

source: །དེ་ཉིད་ལ་སྐྱབས་སུ་འགྲོའོ།
en: I will go for refuge in him.

source: །མཚུངས་པ་མེད་པའི་སྙིང་བརྩེ་བ་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པ་རྒྱལ་བ་བཟོད་པ་ཅན་དེ་ལ་སྐྱབས་སུ་འགྲོ་བ་ནི་ང་དང་ལྷན་ཅིག་འདོང་བར་བྱོས་ཤིག །དེའི་ཆོས་བསྟན་དུ་མེད་པ་ཉོན་ཅིག །ཉོན་མོངས་པའི་དྲ་བ་ཆོད་ཅིག །རྡུལ་མེད་ཅིང་འཇིགས་པ་མེད་པའི་གྲོང་ཁྱེར་དུ་འཇུག་པར་བྱོས་ཤིག །
en: Come with me and take refuge in that forgiving victor who possesses such great and incomparable love. Come and listen to his Dharma, which cannot be illustrated! Sever the web of your afflictions and enter the city of purity and fearlessness!”

source: དེ་ནས་བདུད་སྡིག་ཅན་འཁོར་བྱེ་བ་ཕྲག་བརྒྱད་ཅུ་དང་ལྡན་པས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ་ཞེས་བྱ་བའི་བར་དུའོ། །
en: The evil Māra and the eight hundred million members of his retinue then prostrated to the feet of the Blessed One and said:

source: རྐང་གཉིས་དམ་པ་ཤིན་ཏུ་ཞི་མཛད་པ།
en: “Sublime human, great pacifier,

source: །བཟོད་སྟོབས་དེས་མཐུ་ཅན་ལ་བཟོད་པར་གསོལ།
en: Please forgive us pernicious beings through your mighty tolerance!

source: །ཁྱོད་ཀྱི་ཡོན་ཏན་བདག་གིས་ཀུན་ཏུ་འཚལ།
en: We know your qualities;

source: །བདག་གིས་ལོག་པ་གང་བགྱིས་དེ་བཟོད་གསོལ།
en: Please forgive us for all the wrong actions we have committed!

source: །དུས་གསུམ་རྒྱལ་བ་ཀུན་ལ་བདག་ཕྱག་འཚལ།
en: “We pay homage to all the victors of the three times,

source: །ཆོས་དང་དགེ་འདུན་ལ་ཡང་བདག་སྐྱབས་མཆི།
en: And we go for refuge in the Dharma and the Saṅgha.

source: །བླ་མ་བདག་གི་ནོངས་པར་གཟུང་དུ་གསོལ།
en: Master, please accept this confession of our faults!

source: །སླན་ཆད་ཁྱོད་ལ་བདག་འཁྲུག་ཡོང་མི་བགྱིད།
en: We will never cause you trouble again!”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བདུད་སྡིག་ཅན་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ།
en: The Blessed One replied to the evil Māra:

source: །ང་ལ་ཁྲོ་མེད་ཉོན་མོངས་ཐམས་ཅད་མེད།
en: “I am devoid of anger and all the other afflictions,

source: །རྟག་ཏུ་སེམས་ཅན་ཀུན་ལ་སེམས་སྙོམས་ཏེ།
en: And I am always impartial toward all beings.

source: །བདུད་ཁྱོད་ལ་ནི་སེམས་ཀྱང་དགའ་བ་ཡིན།
en: Māra, I rejoice in your attitude.

source: །རྒྱལ་བ་བཟོད་པའི་ཐུགས་ལྡན་རྟག་ཏུ་བཟོད།
en: The Victor is tolerant; he always forgives!”

source: །དེ་ནས་བདུད་སྡིག་ཅན་མཆོག་ཏུ་དགའ་བ་དང་དད་པ་སྐྱེས་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ། ལན་གསུམ་བསྐོར་བ་བྱས་ནས་བཅོམ་ལྡན་འདས་འབའ་ཞིག་ལ་བལྟ་ཞིང་འདུག་གོ།
en: Filled with intense joy and faith, the evil Māra prostrated to the feet of the Blessed One and circumambulated him three times. He then sat down, gazing one-pointedly at the Blessed One.
